# 语法：序列名[开始位置的下标：结束位置的下标：步长]

str1 = '012345678'

print(str1[2:5:1])  # 234
print(str1[2:5])    # 234
print(str1[2:5:2]) # 24

print(str1[:5])    # 01234  不写开始默认为0
print(str1[2:])   # 2345678 不写结束选取到最后
print(str1[:])   # 012345678 不写开始结束选取到所有，复制序列


# 负数测试
print(str1[::-1])  #876543210 步长为负数，表示倒序选取
print(str1[-4:-1])  #567  下标-1表示最后一个数据，依次向前类推

# 终极测试
print(str1[-4:-1:1])  # 567
print(str1[-4:-1:-1]) #不能选取数据，从-4开始到-1结束选取方向为从左到右，步长为-1表示从右到左选取
# **** 如果选取方向和步长方向冲突，则无法选取数据

print(str1[-1:-4:-1]) # 876